# Importando base de datos

In [ ]:
import pandas as pd

In [ ]:
pd.read_csv('credit_card.csv')

      LIMIT_BAL CHECKING_ACCOUNT  ...     PAY_AMT DEFAULT
0          6022              Yes  ...      0.0000       1
1         36132              Yes  ...      0.0000       1
2         27099              Yes  ...    457.0698       0
3         15055              Yes  ...    602.2000       0
4        150550               No  ...  16560.5000       0
...         ...              ...  ...         ...     ...
1495      54198              Yes  ...      0.0000       1
1496      45165               No  ...   1144.1800       0
1497      78286               No  ...    962.9178       0
1498       6022               No  ...    864.7592       0
1499     183671               No  ...  97022.8508       0

[1500 rows x 8 columns]

In [ ]:
datos = pd.read_csv('credit_card.csv')

In [ ]:
datos.head()

   LIMIT_BAL CHECKING_ACCOUNT  ...     PAY_AMT DEFAULT
0       6022              Yes  ...      0.0000       1
1      36132              Yes  ...      0.0000       1
2      27099              Yes  ...    457.0698       0
3      15055              Yes  ...    602.2000       0
4     150550               No  ...  16560.5000       0

[5 rows x 8 columns]

In [ ]:
datos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   LIMIT_BAL         1500 non-null   int64
 1   CHECKING_ACCOUNT  1500 non-null   object
 2   EDUCATION         1500 non-null   object
 3   MARRIAGE          1500 non-null   object
 4   AGE               1500 non-null   int64
 5   BILL_AMT          1500 non-null   float64
 6   PAY_AMT           1500 non-null   float64
 7   DEFAULT           1500 non-null   int64
dtypes: float64(2), int64(3), object(3)
memory usage: 93.9+ KB

# Traduciendo variables

In [ ]:
datos.columns

Index(['LIMIT_BAL', 'CHECKING_ACCOUNT', 'EDUCATION', 'MARRIAGE', 'AGE',
       'BILL_AMT', 'PAY_AMT', 'DEFAULT'],
      dtype='object')

In [ ]:
dic_columnas = {
    'LIMIT_BAL' : 'limite', 
    'CHECKING_ACCOUNT' : 'cuenta_corriente', 
    'EDUCATION' : 'escolaridad', 
    'MARRIAGE' : 'estado_civil', 
    'AGE' : 'edad',
    'BILL_AMT' : 'valor_factura', 
    'PAY_AMT' : 'valor_pago', 
    'DEFAULT' : 'moroso'
}

In [ ]:
tarjetas = datos.rename(columns = dic_columnas)

In [ ]:
tarjetas.head()

   limite cuenta_corriente  ...  valor_pago moroso
0    6022              Yes  ...      0.0000      1
1   36132              Yes  ...      0.0000      1
2   27099              Yes  ...    457.0698      0
3   15055              Yes  ...    602.2000      0
4  150550               No  ...  16560.5000      0

[5 rows x 8 columns]

In [ ]:
tarjetas.cuenta_corriente.unique()

array(['Yes', 'No'], dtype=object)

In [ ]:
dic_cuenta = {
    'Yes' : 'Si', 
    'No' : 'No'
}

In [ ]:
tarjetas.cuenta_corriente.map(dic_cuenta)

0       Si
1       Si
2       Si
3       Si
4       No
        ..
1495    Si
1496    No
1497    No
1498    No
1499    No
Name: cuenta_corriente, Length: 1500, dtype: object

In [ ]:
tarjetas.head()

   limite cuenta_corriente  ...  valor_pago moroso
0    6022              Yes  ...      0.0000      1
1   36132              Yes  ...      0.0000      1
2   27099              Yes  ...    457.0698      0
3   15055              Yes  ...    602.2000      0
4  150550               No  ...  16560.5000      0

[5 rows x 8 columns]

In [ ]:
tarjetas.cuenta_corriente = tarjetas.cuenta_corriente.map(dic_cuenta)

In [ ]:
tarjetas.head()

   limite cuenta_corriente  ...  valor_pago moroso
0    6022               Si  ...      0.0000      1
1   36132               Si  ...      0.0000      1
2   27099               Si  ...    457.0698      0
3   15055               Si  ...    602.2000      0
4  150550               No  ...  16560.5000      0

[5 rows x 8 columns]

In [ ]:
tarjetas.escolaridad.unique()

array(['2.University', '3.Graduate School', '1.High School'], dtype=object)

In [ ]:
dic_escolaridad = {
    '2.University' : '2.Universidad', 
    '3.Graduate School' : '3.Pos-graduaciÃ³n', 
    '1.High School' : '1.Colegio'
}

In [ ]:
tarjetas.escolaridad = tarjetas.escolaridad.map(dic_escolaridad)

In [ ]:
tarjetas.head()

   limite cuenta_corriente       escolaridad  ... valor_factura  valor_pago  moroso
0    6022               Si     2.Universidad  ...      934.0122      0.0000       1
1   36132               Si     2.Universidad  ...      519.3975      0.0000       1
2   27099               Si     2.Universidad  ...     4223.5297    457.0698       0
3   15055               Si     2.Universidad  ...    14522.9563    602.2000       0
4  150550               No  3.Pos-graduaciÃ³n  ...   124060.1253  16560.5000       0

[5 rows x 8 columns]

In [ ]:
tarjetas.estado_civil.unique()

array(['Married', 'Single'], dtype=object)

In [ ]:
dic_estado_civil = {
    'Married' : 'Casado/a', 
    'Single' : 'Soltero/a'
}

In [ ]:
tarjetas.estado_civil = tarjetas.estado_civil.map(dic_estado_civil)

In [ ]:
tarjetas.head()

   limite cuenta_corriente       escolaridad  ... valor_factura  valor_pago  moroso
0    6022               Si     2.Universidad  ...      934.0122      0.0000       1
1   36132               Si     2.Universidad  ...      519.3975      0.0000       1
2   27099               Si     2.Universidad  ...     4223.5297    457.0698       0
3   15055               Si     2.Universidad  ...    14522.9563    602.2000       0
4  150550               No  3.Pos-graduaciÃ³n  ...   124060.1253  16560.5000       0

[5 rows x 8 columns]